In [98]:
import pandas as pd
import numpy as np
from numpy import nan as NA
import os
from pathlib import Path
project_dir = Path.home().joinpath('Desktop\Git\Test\pydata-book-2nd-edition')
import re
import json
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
string_data = pd.Series(['aaaaa','bbbbb',np.nan,'ccccc'])
string_data

0    aaaaa
1    bbbbb
2      NaN
3    ccccc
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [6]:
string_data

0     None
1    bbbbb
2      NaN
3    ccccc
dtype: object

In [9]:
data = pd.Series([1,np.nan,2,NA,7])
data[data.notnull()]

0    1.0
2    2.0
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1,2,3],[1,NA,NA],[NA,NA,NA],[NA,6,3]])
data

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [15]:
data.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [31]:
df = pd.DataFrame(np.random.randn(7,3), columns = ('a','b','c'))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          a         b         c
0 -0.169210       NaN       NaN
1 -0.722196       NaN       NaN
2  1.581345       NaN  0.705228
3 -0.561476       NaN  1.428252
4  0.008181  0.091226 -0.372649
5  0.247708  0.571008  1.954771
6 -0.025632  0.332600 -0.203476

In [37]:
df.fillna({'a':123,'b':456,'c' : 789}, inplace=True)
df

          a           b           c
0 -0.169210  456.000000  789.000000
1 -0.722196  456.000000  789.000000
2  1.581345  456.000000    0.705228
3 -0.561476  456.000000    1.428252
4  0.008181    0.091226   -0.372649
5  0.247708    0.571008    1.954771
6 -0.025632    0.332600   -0.203476

In [52]:
df =pd.DataFrame(np.random.randn(6,3),columns = ('a','b','c'))
df

          a         b         c
0  0.441944  0.421354 -0.526603
1 -2.627551  0.927073 -1.569297
2  0.478486 -1.031971  0.446717
3  0.849310  0.296265 -1.897744
4 -1.535954 -0.050653 -0.246738
5 -0.031437  1.193713 -0.472794

In [57]:
df.iloc[2:4,1] = NA
df.iloc[4,2] = NA
df

          a         b         c
0  0.441944  0.421354 -0.526603
1 -2.627551  0.927073 -1.569297
2  0.478486       NaN  0.446717
3  0.849310       NaN -1.897744
4 -1.535954       NaN       NaN
5 -0.031437  1.193713 -0.472794

In [65]:
df.fillna(df.mean())

          a         b         c
0  0.441944  0.421354 -0.526603
1 -2.627551  0.927073 -1.569297
2  0.478486  0.847380  0.446717
3  0.849310  0.847380 -1.897744
4 -1.535954  0.847380 -0.803944
5 -0.031437  1.193713 -0.472794

In [66]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [71]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.094832
   2    0.713146
   3    1.465407
b  1    1.319029
   3    3.237400
c  1    0.470211
   2   -0.289785
d  2    0.591895
   3   -0.439312
dtype: float64

In [74]:
data.unstack()

          1         2         3
a  0.094832  0.713146  1.465407
b  1.319029       NaN  3.237400
c  0.470211 -0.289785       NaN
d       NaN  0.591895 -0.439312

In [75]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
 'data2': range(3)})

In [78]:
pd.merge(df1,df2, on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [79]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [80]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [81]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [82]:
data.unstack()

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [83]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [84]:
os.getcwd()

'c:\\Users\\kienn\\Desktop\\Git\\Test'

In [126]:
data = pd.read_csv(project_dir.joinpath('examples/macrodata.csv'))
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [127]:
periods = pd.PeriodIndex(year = data.year, quarter = data.quarter, name ='date')
columns = pd.Index(['realgdp', 'infl','unemp'],name = 'item')
data = data.reindex(columns = columns)

In [128]:
data.index = periods.to_timestamp('D')
data

item          realgdp  infl  unemp
date
1959-01-01   2710.349  0.00    5.8
1959-04-01   2778.801  2.34    5.1
1959-07-01   2775.488  2.74    5.3
1959-10-01   2785.204  0.27    5.6
1960-01-01   2847.699  2.31    5.2
...               ...   ...    ...
2008-07-01  13324.600 -3.16    6.0
2008-10-01  13141.920 -8.79    6.9
2009-01-01  12925.410  0.94    8.1
2009-04-01  12901.504  3.37    9.2
2009-07-01  12990.341  3.56    9.6

[203 rows x 3 columns]

In [129]:
data.stack().reset_index().rename(columns ={0:'value'})

          date     item      value
0   1959-01-01  realgdp   2710.349
1   1959-01-01     infl      0.000
2   1959-01-01    unemp      5.800
3   1959-04-01  realgdp   2778.801
4   1959-04-01     infl      2.340
..         ...      ...        ...
604 2009-04-01     infl      3.370
605 2009-04-01    unemp      9.200
606 2009-07-01  realgdp  12990.341
607 2009-07-01     infl      3.560
608 2009-07-01    unemp      9.600

[609 rows x 3 columns]